design/design.it.tex
% Created 2023-08-18 Fri 10:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Biggie Dickus}
\date{\today}
\title{Jelly: Java embeddable lisp intepreter}
\hypersetup{
 pdfauthor={Biggie Dickus},
 pdftitle={Jelly: Java embeddable lisp intepreter},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

pardon per la \emph{libertà artistica} nella scelta e validità dell'acronimo
\section{Idea Generale}
\label{sec:orgac85115}
Lo scopo è quello di creare un interpreter per lisp che possa essere utilizzato per i cazzi sua o invocato da un app java, l'idea è quella di poter utilizzare questo, tramite una qualche \texttt{FFI} (\texttt{Foreign Function Interface}), per offrire funzionalità di scripting all'interno dell'app java, in modo non dissimile a quanto si possa fare con un python o un clojure.
Questo, si ritiene, non sarebbe niente male come strumento per la configurazione, senza bisogno di re-build, di sistemi complessi (si pensi alla configurazione di un server, o a uno script-fu stile gimp, a un actionscript, \ldots{}), o per permettere un utilizzo interattivo stile \href{https://en.wikipedia.org/wiki/Read\%E2\%80\%93eval\%E2\%80\%93print\_loop}{REPL} del sistema, strumento molto utile durante fasi di prototipazione, e utilizzabile anche per un testing preliminare (considerando che tra lo scriverlo e il testarlo con una shell passano 10 secondi).
Quest'ultimo, in quanto per essere fatto bene richiederebbe anche un minimo di integrazione, o api per integrazione, con editor/ide, non sarà fatto bene.

Il design è vagamente influenzato da \href{https://gitlab.com/embeddable-common-lisp/ecl/}{ecl}, per quanto Jelly non contenga un compiler da lisp a java, visto che non sono ancora a quei livelli.

\section{Componenti}
\label{sec:orge28f9c1}
\subsection{Lisp objects}
\label{sec:org1bb97b7}
In lisp tutto ha un valore di ritorno, nell'ambito di \texttt{Jelly} questo sarà un oggetto che implementa l'interfaccia \texttt{LispObject} (o \texttt{LispValue}, devo decidermi sul nome), visto che in lisp \emph{le variabili non hanno un tipo, e sono invece i valori che hanno un tipo}\footnote{per citare Paul Graham alla cazzo di cane più totale} le implementazioni di \texttt{LispObject} terranno qualche attributo di tipo.

\subsubsection{Tipizzazione}
\label{sec:org029869c}
Questo è un po' un problema al momento, non ho ancora visto come farlo.

\subsection{Funzioni}
\label{sec:org8eb5391}
Da vedere poi se rappresentare le funzioni come oggetti che implementano \texttt{LispCallable}
comunque se lo rappresenti con un \texttt{LispCallable} poi vedi se vuoi mettere il lexenv (che grazialcazzo che lo facciamo con scope lessicale) all'interno del callable o meno.

Vedere inoltre per quanto riguarda le funzioni builtin, si potrebbe avere un \texttt{isBuiltin} e un \texttt{callBuiltin} e magari quelli non implementano il callable, mentre lo potrebbero implementare funzioni user defined
perchè onestamente re-implementare callable per
\begin{itemize}
\item \texttt{cons}
\item \texttt{car}
\item \texttt{cdr}
\item (probabile) \texttt{or}
\item (probabile) \texttt{and}
\item (probabile) \texttt{if}
\item et cetera res
\end{itemize}

mi sembra pessimo design.

\subsection{Runtime}
\label{sec:org6539906}
Per quanto, almeno inizialmente, molte funzionalità di runtime saranno lasciate al runtime di java\footnote{che ci cazzo si mette a scrivere garbage collector per 6 crediti}, sarà comunque necessario rappresentare in qualche modo lo stato della "lisp machine" embedded, con questo si intende l'ambiente di variabili/valori/funzioni presenti, e lo stato della computazione\footnote{daje che si esagera coi termini qui} in corso.
Il runtime sarà inoltre utilizzabile come "handle" al sistema lisp interno per chiamare le funzionalità di questo all'interno dell'app java.
\subsubsection{NON}
\label{sec:orgf3899e1}
\begin{itemize}
\item Non è previsto, per adesso, un meccanismo di multithreading.
\item Non è previsto, per adesso, un meccanismo di gestione delle eccezioni. (poi ovvio che il codice java avrà delle eccezioni)
\item Non è ancora deciso se implementare il runtime come singleton\footnote{come con il rutime di java, che è unico all'interno dell'applicazione} o meno.
\end{itemize}

\section{Verso una qualche idea di interfaccia}
\label{sec:orgcbcd5ff}
Lavorare verso l'implementare una qualche interfaccia prestabilita funziona spesso meglio dell lavorare verso un'idea generica di funzionamento, specie nell'ambito della programmazione a oggetti, (si vada a vedere ad esempio la sezione \href{https://github.com/google/gson\#goals}{goals} di \href{https://github.com/google/gson}{gson})

\subsection{Load, Eval, forse Apply}
\label{sec:org37ff51f}
Il Runtime esporrà i seguenti metodi come pubblici
\begin{description}
\item[{\texttt{LispObject load()}}] accetta un file/filepath e valuta(intepreta) il file/espressione data, modificando lo stato interno del runtime, aggiungendo ad esempio definizioni al vocabolario/stato interno del sistema, o modificando eventuali flag di errore (cosa che potrebbe o non potrebbe essere disgiunta dal modificare il vocabolario del sistema). Ritorna il valore dell'ultima form valutata nel toplevel del file
\item[{\texttt{LispObject eval()}}] valuta una form data, modificando eventualmente lo stato del sistema, ritorna il valore ritornato dalla valutazione della form, probabilmente si farà anche l'overload per accettare stringhe che poi internametne sarà un
\begin{verbatim}
import somepackage.Form;

public class LispRuntime {
    /* ... */
    public LispObject eval(LispForm lf) {
        /* ... */
    }
    public LispObject eval(String s) {
        this.eval(Form.parseFromString(s));
    }
    /* ... */
}
\end{verbatim}
\end{description}


\begin{description}
\item[{\texttt{LispObject apply(LispCallable lc, arglist)}\footnotemark}] \footnotetext[5]{\label{orgc3b48b3}da decidere se inserirlo o meno}chiama il \texttt{LispCallable} (funzoine) \texttt{lc} con argomenti \texttt{arglist}, ritorna il valore ritornato dall'applicazione
\end{description}

\subsubsection{Particolari per file/batch}
\label{sec:org60d8bc1}
Tutto coperto da \texttt{load()} per adesso, \texttt{eval()} se proprio si vuole esagerare

\subsubsection{Particolari per REPL}
\label{sec:org9672088}
Probabilmente invocato attraverso un \texttt{Runtime.repl()}, anche se facilmente spostabile a un qualche altro oggetto che comunicherà comunque col runtime, il repl agirà nel seguente modo
\begin{description}
\item[{read}] \begin{itemize}
\item accetta caratteri finchè non si ha una form completa (bilanciamento (o assenza) di parentesi alla fine di un token)
\item traduce i caratteri ricevuti in form per essere valutata
\end{itemize}
\item[{eval}] valuta la form letta dal passo \texttt{read}, la cosa può anche produrre side effect quali stampa di caratteri, apertura/creazione/modifica di file, et al
\item[{print}] stampa il valore ottenuto dalla valutazione
\item[{loop}] torna al passo \texttt{read} (a meno che la valutazoine della form non implichi anche l'arresto del loop)
\end{description}

\section{Struttura dell'interpreter}
\label{sec:org07fbdce}
L'interpreter ha il ruolo di passare da una rappresentazione testuale del programma all'aver fatto qualcosa, questo sarà diviso in due componenti
la struttura sotto data si aspetta una qualche rappresentazione testuale, se questa poi arriva da una stringa\footnote{stile \texttt{python -c "print(max(\$1, \$2))"} buttato lì in uno script perchè nessuno\footnotemark sa usare l'algebra in bash}\footnotetext[7]{\label{org3b05c1a}me incluso} o dall'apertura di un file, cazzi altrui.
\begin{description}
\item[{preprocessor}] si occupa\footnote{per ora} di rimuovere i commenti dal testo ricevuto, vedere poi se si vuole aggiungere un meccanismo di macro o meno.
\item[{parser}] traduce la rappresentazione testuale del programma in una lista a \texttt{cons}
\item[{evaluator}] esegue quanto rappresentato nella lista a \texttt{cons}
\end{description}

La rappresentazione interna è una lista a \texttt{cons}\footnote{nome tra il lispone e il fru fru per dire un albero binario}, che costituisce sia la struttura sia dati fondamentale, che la rappresentazione intemedia, del nostro codice.
Questa rappresentazione è stata scelta in quanto questa struttura dati, e questa equivalenza codice/dati, costituiscono una precentuale anche troppo alta del dna di lisp.

\subsection{Parser}
\label{sec:org632be9d}
l'ultima volta fare questo è stato un aborto perchè non avevo idea di cosa fosse un pda o una grammatica libera dal contesto.
questa volta, se non riutilizzo il codice già fatto, essendo che so cos'è un pda o una grammatica libera dal contesto, questo sarà una psicosi post parto

\subsection{Evaluator}
\label{sec:orgaf472c2}
la struttura dell'evaluator è gratuitamente "ispirata" a quelle presenti in
\href{https://direct.mit.edu/books/book/2851/LISP-1-5-Programmer-s-Manual}{The Lisp1.5 Programmer's Manual}, nell'introduzoine al linguaggio e in \href{https://web.mit.edu/6.001/6.037/sicp.pdf}{Structure and Intepretation of Computer Programs}\footnote{da qui in poi anche detto \texttt{SICP}.}, nel capitolo \texttt{4}, specie la sezione \texttt{4.1, The Metacircular Evaluator}.
Queste ovviamente adattate a un ambiente più imperativo e object oriented, visto che tradurre direttamente il codice lisp in codice java porterebbe ad abominii contro la madre quel poveraccio di un Guy Steele.\footnote{se questo per oltraggi a lisp\footnotemark o java\footnotemark, lo decida il lettore}\footnotetext[12]{\label{org4cf59f8}di cui ha scritto lo standard(almeno per common lisp e scheme)}\footnotetext[13]{\label{org85cffa5}di cui ha scritto lo standard}.
\end{document}